LonelyWolf/stm32/stm32l151rdt6-dev/main.c
#include <stm32l1xx_rcc.h>
#include <stm32l1xx_gpio.h>
#include <stm32l1xx_syscfg.h>
#include <misc.h>
#include <math.h> // Don't forget to add '-lm' linker option (damn CoIDE)

// Debug
#include <stdio.h>

// Libraries
#include "wolk.h"
#include "i2c.h"
#include "RTC.h"
#include "bmp180.h"
#include "bmc050.h"
#include "tsl2581.h"
#include "beeper.h"
#include "delay.h"
#include "sdcard-sdio.h"
#include "log.h"
#include "spi.h"
#include "nRF24.h"
#include "uart.h"
#include "ST7541.h"

// USB stuff
#include "usb_lib.h"
#include "VCP.h"

// DOSFS
#include "dosfs.h"

// Resources
#include <font5x7.h>
#include <font7x10.h>




// GPS enable (PC1)
#define PWR_GPS_ENABLE_PORT       GPIOC
#define PWR_GPS_ENABLE_PIN        GPIO_Pin_1
#define PWR_GPS_ENABLE_PERIPH     RCC_AHBPeriph_GPIOC
#define PWR_GPS_ENABLE_H()        PWR_GPS_ENABLE_PORT->BSRRL = PWR_GPS_ENABLE_PIN
#define PWR_GPS_ENABLE_L()        PWR_GPS_ENABLE_PORT->BSRRH = PWR_GPS_ENABLE_PIN

// Vbat measure enable (PC3)
#define PWR_VBAT_ENABLE_PORT      GPIOC
#define PWR_VBAT_ENABLE_PIN       GPIO_Pin_3
#define PWR_VBAT_ENABLE_PERIPH    RCC_AHBPeriph_GPIOC
#define PWR_VBAT_ENABLE_H()       PWR_VBAT_ENABLE_PORT->BSRRL = PWR_VBAT_ENABLE_PIN
#define PWR_VBAT_ENABLE_L()       PWR_VBAT_ENABLE_PORT->BSRRH = PWR_VBAT_ENABLE_PIN

// LCD boost enable (PA4)
#define PWR_LCD_ENABLE_PORT       GPIOA
#define PWR_LCD_ENABLE_PIN        GPIO_Pin_4
#define PWR_LCD_ENABLE_PERIPH     RCC_AHBPeriph_GPIOA
#define PWR_LCD_ENABLE_H()        PWR_LCD_ENABLE_PORT->BSRRL = PWR_LCD_ENABLE_PIN
#define PWR_LCD_ENABLE_L()        PWR_LCD_ENABLE_PORT->BSRRH = PWR_LCD_ENABLE_PIN

// SD card enable (PA9)
#define PWR_SD_ENABLE_PORT        GPIOA
#define PWR_SD_ENABLE_PIN         GPIO_Pin_9
#define PWR_SD_ENABLE_PERIPH      RCC_AHBPeriph_GPIOA
#define PWR_SD_ENABLE_H()         PWR_SD_ENABLE_PORT->BSRRL = PWR_SD_ENABLE_PIN
#define PWR_SD_ENABLE_L()         PWR_SD_ENABLE_PORT->BSRRH = PWR_SD_ENABLE_PIN

// USB sense pin (PA10)
#define USB_SENS_PORT             GPIOA
#define USB_SENS_PIN              GPIO_IDR_IDR_10
#define USB_SENS_PERIPH           RCC_AHBPeriph_GPIOA
#define USB_SENS_EXTI             (1 << 10)
#define USB_SENS_EXTI_N           EXTI15_10_IRQn

// Charger STAT pin (PC2)
#define CHRG_STAT_PORT            GPIOC
#define CHRG_STAT_PIN             GPIO_IDR_IDR_2
#define CHRG_STAT_PERIPH          RCC_AHBPeriph_GPIOC

// SD detect pin (PB3)
#define SD_DETECT_PORT            GPIOB
#define SD_DETECT_PIN             GPIO_IDR_IDR_3
#define SD_DETECT_PERIPH          RCC_AHBPeriph_GPIOB
#define SD_DETECT_EXTI            (1 << 3)
#define SD_DETECT_EXTI_N          EXTI3_IRQn

// BMC050 IRQ pin (PC13)
#define ACC_IRQ_PORT              GPIOC
#define ACC_IRQ_PIN               GPIO_Pin_13
#define ACC_IRQ_PERIPH            RCC_AHBPeriph_GPIOC
#define ACC_IRQ_EXTI              (1 << 13)
#define ACC_IRQ_EXTI_N            EXTI15_10_IRQn

// LCD backlight pin (PB4)
#define LCD_BL_PIN_PERIPH         RCC_AHBENR_GPIOBEN
#define LCD_BL_PORT               GPIOB
#define LCD_BL_PIN                GPIO_Pin_4
#define LCD_BL_PIN_SRC            GPIO_PinSource4
#define LCD_BL_GPIO_AF            GPIO_AF_TIM3
#define LCD_BL_H()                LCD_BL_PORT->BSRRL = LCD_BL_PIN
#define LCD_BL_L()                LCD_BL_PORT->BSRRH = LCD_BL_PIN
#define LCD_BL_TIM_RCC            RCC->APB1ENR
#define LCD_BL_TIM_PERIPH         RCC_APB1ENR_TIM3EN
#define LCD_BL_TIM                TIM3


// Reset source
#define RESET_SRC_UNKNOWN         (uint32_t)0x00000000 // Unknown reset source
#define RESET_SRC_POR             (uint32_t)0x00000001 // POR/PDR (Power On Reset or Power Down Reset)
#define RESET_SRC_SOFT            (uint32_t)0x00000002 // Software reset
#define RESET_SRC_PIN             (uint32_t)0x00000004 // Reset from NRST pin
#define RESET_SRC_STBY            (uint32_t)0x00000008 // Reset after STANBY, wake-up flag set (RTC or WKUP# pins)
#define RESET_SRC_STBY_WP1        (uint32_t)0x00000010 // Reset after STANBY, wake-up from WKUP1 pin
#define RESET_SRC_STBY_WP2        (uint32_t)0x00000020 // Reset after STANBY, wake-up from WKUP2 pin




// It's obvious!
uint32_t i,j,k;

// Reset source
uint32_t _reset_source = RESET_SRC_UNKNOWN;

// USB
volatile uint32_t _USB_int_cntr = 0;
volatile uint32_t _USB_connected = 0;

// SD
volatile uint32_t _SD_int_cntr = 0;
volatile uint32_t _SD_connected = 0;
volatile uint32_t _SD_last_state = 0;
uint8_t sector[2048] __attribute__((aligned(4)));

// ALS variables
uint16_t d0,d1;

// BMP180 variables
BMP180_RESULT BR;
int16_t RT;
int32_t RP;
int16_t X,Y,Z,ACCT;

// ADC variables
uint16_t ADC1_raws[16],Vrefint_raws[16];
uint32_t ADC1_raw,Vrefint_raw;
uint32_t Vbat,Vrefint,Vcpu;

// nRF24 variables
//#define NRF24_SOLAR // if defined - receive solar powered temperature sensor, WBC otherwise
#ifdef NRF24_SOLAR
// Yes, this is redefinition from wolk.h (must be warn from compiler for the following lines)
#define nRF24_RX_Addr               "WolkT" // RX address for nRF24L01
#define nRF24_RX_Addr_Size                5 // RX address size
#define nRF24_RF_CHANNEL                110 // nRF24L01 channel (110CH = 2510MHz)
#define nRF24_RX_PAYLOAD                 18 // nRF24L01 payload length
uint8_t nRF24_RX_Buf[nRF24_RX_PAYLOAD]; // nRF24L01 payload buffer
bool _logging = FALSE;
#else
uint8_t nRF24_RX_Buf[nRF24_RX_PAYLOAD]; // nRF24L01 payload buffer for WBC
#endif
volatile bool _new_packet = FALSE;
uint32_t _packets_rcvd = 0; // Received packets counter
uint32_t _packets_lost = 0; // Lost packets counter
uint32_t _prev_wake_cntr = 0xDEADBEEF; // Prevous wake counter (to count lost packets)

// Date/Time
RTC_TimeTypeDef _time;
RTC_DateTypeDef _date;

// LCD debug
uint8_t lcd_char = 33;
uint8_t lcd_backlight = 10;

// Flags
volatile bool _new_time = FALSE;

// SPL
GPIO_InitTypeDef PORT;
NVIC_InitTypeDef NVICInit;




// Determine source of reset
uint32_t GetResetSource(void) {
	uint32_t result = RESET_SRC_UNKNOWN;
	uint32_t reg;

	// Reset source
	reg = RCC->CSR;
	if (reg & RCC_CSR_SFTRSTF) {
		result |= RESET_SRC_SOFT;
	} else if (reg & RCC_CSR_PORRSTF) {
		result |= RESET_SRC_POR;
	} else if (reg & RCC_CSR_PINRSTF) {
		result |= RESET_SRC_PIN;
	}

	// Clear the reset flags
	RCC->CSR |= RCC_CSR_RMVF;

