LonelyWolf/stm32/stm32l151rdt6-dev/main.c
	// Enable the PWR peripheral to deal with it CSR register
	RCC->APB1ENR |= RCC_APB1ENR_PWREN;
	__DSB();

	// WKUP pin or RTC alarm
	reg = PWR->CSR;
	if (reg & PWR_CSR_WUF) {
		if (reg & PWR_CSR_SBF) result |= RESET_SRC_STBY;

		// Clear the wake-up and standby flags
		PWR->CR |= PWR_CR_CWUF | PWR_CR_CSBF;

		// Remember value of the AHBENR register
		reg = RCC->AHBENR;

		// Determine state of the WKUP# pins
		RCC->AHBENR |= RCC_AHBENR_GPIOAEN | RCC_AHBENR_GPIOCEN;
		__DSB();
		if (GPIOA->IDR & GPIO_IDR_IDR_0)  result |= RESET_SRC_STBY_WP1;
		if (GPIOC->IDR & GPIO_IDR_IDR_13) result |= RESET_SRC_STBY_WP2;

		// Restore value of the AHBENR register
		RCC->AHBENR = reg;
	}

	return result;
}

// Inquiry status of the button
void Button_Inquiry(BTN_TypeDef *button) {
	if (button == &BTN[BTN_ESCAPE]) {
		// Escape button have inverted input
		if (!(button->PORT->IDR & button->PIN)) {
		    // Button released
			button->hold_cntr = 0;
			if (button->state != BTN_Hold) button->cntr++;
			button->state = BTN_Released;
			// Disable sleep-on-exit (return to main loop from IRQ)
			SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;

			BEEPER_Enable(200,1);
		} else {
			// Button pressed
			button->hold_cntr = 0;
			button->state = BTN_Pressed;

			BEEPER_Enable(2000,1);
		}
	} else {
		if (button->PORT->IDR & button->PIN) {
		    // Button released
			button->hold_cntr = 0;
			if (button->state != BTN_Hold) button->cntr++;
			button->state = BTN_Released;
			// Disable sleep-on-exit (return to main loop from IRQ)
			SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;

			BEEPER_Enable(200,1);
		} else {
			// Button pressed
			button->hold_cntr = 0;
			button->state = BTN_Pressed;

			BEEPER_Enable(2000,1);
		}
	}
}

// RTC wake-up IRQ handler
void RTC_WKUP_IRQHandler(void) {
	if (RTC->ISR & RTC_ISR_WUTF) {
		// RTC Wake-up interrupt

		// Get current date/time
		RTC_GetDateTime(&_time,&_date);

		_new_time = TRUE;

		// Disable sleep-on-exit (return to main loop from IRQ)
		SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;

		PWR->CR  |= PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers enabled
		RTC->ISR &= ~RTC_ISR_WUTF; // Clear the RTC wake-up timer flag
		PWR->CR  &= ~PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers disabled

		EXTI->PR = RTC_WKUP_EXTI; // Clear the EXTI pending bit
	}
}

// RTC alarm IRQ handler
void RTC_Alarm_IRQHandler(void) {
	if (RTC->ISR & RTC_ISR_ALRAF) {
		// RTC alarm A interrupt

		BEEPER_PlayTones(tones_3beep);

		PWR->CR  |= PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers enabled
		RTC->ISR &= ~RTC_ISR_ALRAF; // Clear the RTC alarm A flag
		PWR->CR  &= ~PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers disabled

		EXTI->PR = RTC_ALARM_EXTI; // Clear the EXTI pending bit
	}
}

// EXTI0 line IRQ handler
void EXTI0_IRQHandler(void) {
	if (EXTI->PR & BTN3_EXTI) {
		// EXTI0 (Button#3 -> "ESCAPE")
		Button_Inquiry(&BTN[BTN_ESCAPE]);
		EXTI->PR = BTN3_EXTI; // Clear IT bit for EXTI_line
	}
}

// EXTI1 line IRQ handler
void EXTI1_IRQHandler(void) {
	nRF24_RX_PCKT_TypeDef RX_status;
	uint8_t CRC_local;
	uint16_t wake_diff;
	uint16_t *ptr = (uint16_t *)&nRF24_RX_Buf;

	if (EXTI->PR & nRF24_IRQ_EXTI) {
		RX_status = nRF24_RXPacket(nRF24_RX_Buf,nRF24_RX_PAYLOAD);
		if (RX_status == nRF24_RX_PCKT_PIPE0) {
			// Bytes of 16-bit values must be swapped due to different endianness of STM8L and STM32
/*
			nRF24_Packet.cntr_SPD  =  (nRF24_RX_Buf[0] << 8) | nRF24_RX_Buf[1];
			nRF24_Packet.tim_SPD   =  (nRF24_RX_Buf[2] << 8) | nRF24_RX_Buf[3];
			nRF24_Packet.tim_CDC   =  (nRF24_RX_Buf[4] << 8) | nRF24_RX_Buf[5];
			nRF24_Packet.vrefint   = ((nRF24_RX_Buf[6] << 8) | nRF24_RX_Buf[7]) & 0x03ff;
			nRF24_Packet.cntr_wake =  (nRF24_RX_Buf[8] << 8) | nRF24_RX_Buf[9];
			nRF24_Packet.CRC8      =   nRF24_RX_Buf[10];
*/
			// This code looks cooler and its size is 40 bytes less
			nRF24_Packet.cntr_SPD  = __builtin_bswap16(*ptr++);
			nRF24_Packet.tim_SPD   = __builtin_bswap16(*ptr++);
			nRF24_Packet.tim_CDC   = __builtin_bswap16(*ptr++);
			nRF24_Packet.vrefint   = __builtin_bswap16(*ptr++);
			nRF24_Packet.cntr_wake = __builtin_bswap16(*ptr++);
			nRF24_Packet.CRC8 = nRF24_RX_Buf[10];

			CRC_local = CRC8_CCITT(nRF24_RX_Buf,nRF24_RX_PAYLOAD - 1);
			if (CRC_local == nRF24_Packet.CRC8) {
				if (_prev_wake_cntr == 0xDEADBEEF) _prev_wake_cntr = nRF24_Packet.cntr_wake;
				if (nRF24_Packet.cntr_wake < _prev_wake_cntr) _prev_wake_cntr = nRF24_Packet.cntr_wake;
				wake_diff = nRF24_Packet.cntr_wake - _prev_wake_cntr;
				printf("wake: %u[%u] diff: %u vbat=%u.%02uV pkts: %u\\%u [%u%%]\r\n",
						nRF24_Packet.cntr_wake,
						_prev_wake_cntr,
						wake_diff,
						nRF24_Packet.vrefint / 100,nRF24_Packet.vrefint % 100,
						_packets_rcvd,
						_packets_lost,
						(_packets_lost * 100) / (_packets_rcvd + _packets_lost)
				);
				_prev_wake_cntr = nRF24_Packet.cntr_wake;
				if (wake_diff > 1) {
					_packets_lost += wake_diff - 1;
//					BEEPER_Enable(1700,1);
				}
			} else {
				printf("CRC: %02X <> %02X [%s]\r\n",nRF24_Packet.CRC8,CRC_local,(nRF24_Packet.CRC8 == CRC_local) ? "OK" : "BAD");
//				BEEPER_Enable(333,1);
			}
			_packets_rcvd++;
			_new_packet = TRUE;
		} else {
			printf("nRF24_RXPacket:%02X (not a PIPE0)\r\n",(uint8_t)RX_status);
//			BEEPER_Enable(5000,3);
		}


		// Disable sleep-on-exit (return to main loop from IRQ)
		SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;

		// Clear IT bit for EXTI_Line
		EXTI->PR = nRF24_IRQ_EXTI;
	}
}

// EXTI3 line IRQ handler
void EXTI3_IRQHandler(void) {
	if (EXTI->PR & SD_DETECT_EXTI) {
		_SD_int_cntr++;
		_SD_connected = (SD_DETECT_PORT->IDR & SD_DETECT_PIN) ? 0 : 1;
		if (_SD_connected) {
			BEEPER_PlayTones(tones_USB_con);
		} else {
			BEEPER_PlayTones(tones_USB_dis);
		}

		// Clear IT bit for EXTI_Line
		EXTI->PR = SD_DETECT_EXTI;
	}
}

// EXTI[10..15] lines IRQ handler
void EXTI15_10_IRQHandler(void) {
	uint16_t acc_irq;

/*
	// EXTI10 of USB sense conflicts with EXTI10 of button "UP"
	if (EXTI->PR & USB_SENS_EXTI) {
		// USB sense pin
		_USB_int_cntr++;
		_USB_connected = (USB_SENS_PORT->IDR & USB_SENS_PIN) ? 1 : 0;
		if (_USB_connected) {
			BEEPER_PlayTones(tones_USB_con);
		} else {
			BEEPER_PlayTones(tones_USB_dis);
		}
		EXTI->PR = USB_SENS_EXTI; // Clear IT bit for EXTI_Line
	}
*/

	if (EXTI->PR & ACC_IRQ_EXTI) {
		// Accelerometer IRQ pin
		acc_irq = BMC050_ACC_GetIRQStatus(); // <--- Bad idea to call this in IRQ handler
		if (acc_irq & ACC_IRQ_SLOPE) {
			// Slope IRQ high
			BEEPER_Enable(444,1);
		} else {
			// Slope IRQ low
			BEEPER_Enable(3333,1);
		}
		printf("---> ACC IRQ: [%s] <---\r\n",(acc_irq & ACC_IRQ_SLOPE) ? "HIGH" : "LOW");
		EXTI->PR = ACC_IRQ_EXTI; // Clear IT bit for EXTI_line
	}

	if (EXTI->PR & BTN0_EXTI) {
		// EXTI10 (Button#0 -> "UP")
		Button_Inquiry(&BTN[BTN_UP]);
		EXTI->PR = BTN0_EXTI; // Clear IT bit for EXTI_line
	}

