LonelyWolf/stm32/stm32l151rdt6-dev/main.c
	if (EXTI->PR & BTN1_EXTI) {
		// EXTI11 (Button#1 -> "DOWN")
		Button_Inquiry(&BTN[BTN_DOWN]);
		EXTI->PR = BTN1_EXTI; // Clear IT bit for EXTI_line
	}

	if (EXTI->PR & BTN2_EXTI) {
		// EXTI15 (Button#2 -> "ENTER")
		Button_Inquiry(&BTN[BTN_ENTER]);
		EXTI->PR = BTN2_EXTI; // Clear IT bit for EXTI_line
	}
}

// SDIO IRQ handler
void SDIO_IRQHandler(void) {
	printf("\r\n###> IRQ SDIO [%X] CNT=%u\r\n",SDIO->STA,SDIO->FIFOCNT);

	// Clear SDIO interrupt bit
//	SDIO->ICR = 0x00FFFFFF;
	SDIO->ICR = SDIO_ICR_TXUNDERRC;
}

// DMA2 channel4 IRQ handler (SDIO DMA)
void DMA2_Channel4_IRQHandler(void) {
	uint32_t cntr;

	cntr = SDIO_DMA_CH->CNDTR;
	printf("\r\n###> IRQ DMA2 [%X] [%u]\r\n",DMA2->ISR,cntr);

	// Clear DMA interrupt bits
	DMA2->IFCR = DMA_IFCR_CGIF4 | DMA_IFCR_CHTIF4 | DMA_IFCR_CTCIF4 | DMA_IFCR_CTEIF4;
}

// Compute interquartile mean from array of values
uint32_t InterquartileMean(uint16_t *array, uint32_t numOfSamples) {
	uint32_t sum = 0;
	uint32_t index, maxindex;

	// discard the lowest and the highest data samples
	maxindex = 3 * (numOfSamples >> 2);
	for (index = numOfSamples >> 2; index < maxindex; index++) sum += array[index];

	// return the mean value of the remaining samples value
	return (sum / (numOfSamples >> 1));
}




int main(void) {
	// Determine wake-up source
	_reset_source = GetResetSource();




	// PB4 after reset acts as NJTRST input with pull-up (PB4 configure as alternative function)
	// The LED backlight PWM output must be tied to ground ASAP
	// Configure PB4 as GPIO
	RCC->AHBENR |= RCC_AHBENR_GPIOBEN;
	__DSB();
	GPIOB->MODER &= ~GPIO_MODER_MODER4; // Input
	GPIOB->PUPDR &= ~GPIO_PUPDR_PUPDR4; // No pull-up, pull-down




	// Just for fun...
	// If wake-up was from RTC then do BEEP and go back STANDBY mode
	// If wake-up was from WKUP2 pin (accelerometer IRQ) then do BEEP, wait while IRQ asserted
	//                     do another BEEP and go back STANBY mode
	// If wake-up was from WKUP1 pin (ESCAPE button), then skip this and go to normal operation
	if ((_reset_source & RESET_SRC_STBY) && !(_reset_source & RESET_SRC_STBY_WP1)) {
		// At this time the MSI clock is used as system clock (~2.097MHz)
		// Rise it up to ~4.194MHz to do proper beep
		i = (RCC->ICSCR & ~RCC_ICSCR_MSIRANGE); // Clear MSIRANGE bits
		RCC->ICSCR = i | RCC_ICSCR_MSIRANGE_6; // Set MSI range 6 (around 4.194MHz)

		// Enable the PWR peripheral to deal with it CSR register
		RCC->APB1ENR |= RCC_APB1ENR_PWREN;
		__DSB();

		// Compute the actual MCU clock speed (for proper BEEPER initialization)
		SystemCoreClockUpdate();

		// Initialize BEEPER and do BEEP to indicate what MCU is awake
		BEEPER_Init();

		if (_reset_source & RESET_SRC_STBY_WP2) {
			// Initialize BEEPER and do BEEP to indicate what MCU is awake
//			BEEPER_Init();

			// This is wake-up from accelerometer IRQ pin
			BEEPER_Enable(2222,2);

			// Enable the accelerometer IRQ GPIO pin and wait until it becomes low
			RCC->AHBENR |= ACC_IRQ_PERIPH; // Enable GPIO port peripheral
			__DSB();
			ACC_IRQ_PORT->MODER &= ~GPIO_MODER_MODER13; // Input mode (reset state)
			ACC_IRQ_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR13; // Floating (clear bits)
			while (ACC_IRQ_PORT->IDR & ACC_IRQ_PIN);

			// Do another BEEP and wait till it ends
			BEEPER_Enable(444,1);
			while (_beep_duration);
		} else {
			// Initialize display SPI port
			SPIx_Init(ST7541_SPI_PORT,SPI_DIR_TX,SPI_BR_2);

			// Initialize display control pins
			ST7541_InitGPIO();

			ST7541_CS_L();
			ST7541_cmd(0x2f); // Power control: VC,VR,VF = 1,1,1 (internal voltage booster)
			ST7541_CS_H();

			ST7541_SetDisplayPartial(32,0,64);
			ST7541_Contrast(5,5,10);

			// Draw time
			ST7541_Fill(0x0000);
			RTC_GetDateTime(&_time,&_date);
			i = 0;
			i += PutIntLZ(i,42,_time.RTC_Hours,2,fnt5x7);
			i += DrawChar(i,42,':',fnt5x7);
			i += PutIntLZ(i,42,_time.RTC_Minutes,2,fnt5x7);
			i += DrawChar(i,42,':',fnt5x7);
			i += PutIntLZ(i,42,_time.RTC_Seconds,2,fnt5x7);
			i += 3;
			i += PutIntLZ(i,42,_date.RTC_Date,2,fnt5x7);
			i += DrawChar(i,42,'.',fnt5x7);
			i += PutIntLZ(i,42,_date.RTC_Month,2,fnt5x7);
			i += DrawChar(i,42,'.',fnt5x7);
			i += PutIntLZ(i,42,_date.RTC_Year,2,fnt5x7);
			PutStr(i + 3,42,RTC_DOW_STR[_date.RTC_WeekDay - 1],fnt5x7);
			ST7541_Flush();

			// This is wake-up from RTC, do BEEP and wait until it ends
			BEEPER_Enable(1111,1);
			while (_beep_duration);
		}

		// Clear the RTC wake-up timer flag
		// The PWR peripheral must be enabled (in GetResetSource)
		PWR->CR  |= PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers enabled
		RTC->ISR &= ~RTC_ISR_WUTF;
		PWR->CR  &= ~PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers disabled

		// Put MCU into STANDBY mode
		PWR->CSR |= PWR_CSR_EWUP1; // Enable WKUP pin 1 (PA0)
		PWR->CSR |= PWR_CSR_EWUP2; // Enable WKUP pin 2 (PC13)
		SleepStandby();
	}




	// Setup the microcontroller system
	SystemInit();




	// Enable debugging when the MCU is in low power modes
	DBGMCU->CR |= DBGMCU_CR_DBG_SLEEP | DBGMCU_CR_DBG_STOP | DBGMCU_CR_DBG_STANDBY;




/*
	// NVIC: 2 bit for pre-emption priority, 2 bits for subpriority
	// WARNING: this stuff will be re-setup in USB init routine
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
*/




	// Enable the system configuration controller
	RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;




	// UART port initialization
	UARTx_Init(USART2,1382400);
	UART_SendStr(USART2,"--- STM32L151RDT6 ---\r\n");




/*
	// Enable the RTC wake-up interrupt
	NVICInit.NVIC_IRQChannel = RTC_WKUP_IRQn;
	NVICInit.NVIC_IRQChannelCmd = ENABLE;
	NVICInit.NVIC_IRQChannelPreemptionPriority = 0x0f; // 0x0f - lowest priority
	NVICInit.NVIC_IRQChannelSubPriority = 0x00;
	NVIC_Init(&NVICInit);

	// Enable the RTC alarm interrupt
	NVICInit.NVIC_IRQChannel = RTC_Alarm_IRQn;
	NVICInit.NVIC_IRQChannelCmd = ENABLE;
	NVICInit.NVIC_IRQChannelPreemptionPriority = 0x0f; // 0x0f - lowest priority
	NVICInit.NVIC_IRQChannelSubPriority = 0x00;
	NVIC_Init(&NVICInit);
*/

	// Simple enable the RTC wake-up interrupt
	NVIC_EnableIRQ(RTC_WKUP_IRQn);

