LonelyWolf/stm32/stm32l151rdt6-dev/main.c
	// Simple enable the RTC alarm IRQ
	NVIC_EnableIRQ(RTC_Alarm_IRQn);

	// Enable and configure RTC
	RTC_Config();
	if (_reset_source & RESET_SRC_POR) {
		// Set time only in case of POR/PDR (power on/power down reset)
		_time.RTC_Hours   = 0;
		_time.RTC_Minutes = 0;
		_time.RTC_Seconds = 0;
		_date.RTC_Date    = 13;
		_date.RTC_Month   = 02;
		_date.RTC_Year    = 15;
		_date.RTC_WeekDay = RTC_DOW_FRIDAY;
		RTC_SetDateTime(&_time,&_date);
	}
	RTC_ITConfig(RTC_IT_WUT,ENABLE);
	RTC_GetDateTime(&_time,&_date);

//	RTC_SetWakeUp(2); // Wake every 2 seconds
	RTC_SetWakeUp(10); // Wake every 10 seconds
//	RTC_SetWakeUp(30); // Wake every 30 seconds
//	RTC_SetWakeUp(60); // Wake every minute
//	RTC_SetWakeUp(120); // Wake every 2 minutes




	// Initialize delay
	Delay_Init(NULL);




	// Initialize beeper
	BEEPER_Init();




	// Enable power control lines GPIO peripherals
	RCC->AHBENR |= (PWR_GPS_ENABLE_PERIPH | PWR_SD_ENABLE_PERIPH | PWR_VBAT_ENABLE_PERIPH | PWR_LCD_ENABLE_PERIPH);

	// Configure power control lines as push-pull output without pull-up
	PORT.GPIO_Mode  = GPIO_Mode_OUT;
	PORT.GPIO_Speed = GPIO_Speed_400KHz;
	PORT.GPIO_OType = GPIO_OType_PP;
	PORT.GPIO_PuPd  = GPIO_PuPd_NOPULL;

	PORT.GPIO_Pin = PWR_GPS_ENABLE_PIN;
	GPIO_Init(PWR_GPS_ENABLE_PORT,&PORT);
	PWR_GPS_ENABLE_L(); // Turn it off

	PORT.GPIO_Pin = PWR_SD_ENABLE_PIN;
	GPIO_Init(PWR_SD_ENABLE_PORT,&PORT);
	PWR_SD_ENABLE_L(); // Turn it off

	PORT.GPIO_Pin = PWR_VBAT_ENABLE_PIN;
	GPIO_Init(PWR_VBAT_ENABLE_PORT,&PORT);
	PWR_VBAT_ENABLE_L(); // Turn it off

	PORT.GPIO_Pin = PWR_LCD_ENABLE_PIN;
	GPIO_Init(PWR_LCD_ENABLE_PORT,&PORT);
	PWR_LCD_ENABLE_L(); // Turn it off




/*
	// Configure the MCO out
	PORT.GPIO_Pin = GPIO_Pin_8;
	PORT.GPIO_Mode = GPIO_Mode_AF;
	PORT.GPIO_Speed = GPIO_Speed_40MHz;
	PORT.GPIO_OType = GPIO_OType_PP;
	PORT.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOA,&PORT);
	RCC_MCOConfig(RCC_MCOSource_PLLCLK,RCC_MCODiv_16);
*/




	// Enable DC-DC for LCD
//	PWR_LCD_ENABLE_H();
	PWR_LCD_ENABLE_L();

	// Display SPI port initialization: 1-line TX
//	SPIx_Init(ST7541_SPI_PORT,SPI_DIR_TX,SPI_BR_256); // lowest speed (125kHz on 32MHz CPU)
//	SPIx_Init(ST7541_SPI_PORT,SPI_DIR_TX,SPI_BR_2);   // highest speed (16MHz on 32MHz CPU)
	SPIx_Init(ST7541_SPI_PORT,SPI_DIR_TX,SPI_BR_4);   // 8MHz on 32MHz CPU
//	SPIx_Init(ST7541_SPI_PORT,SPI_DIR_TX,SPI_BR_8);   // 4MHz on 32MHz CPU
//	SPIx_Init(ST7541_SPI_PORT,SPI_DIR_TX,SPI_BR_16);  // 2MHz on 32MHz CPU

	// Initialize display and clear screen
	ST7541_InitGPIO();
	ST7541_Init();
	ST7541_Contrast(7,7,24);
	ST7541_Fill(0x0000);
	ST7541_Flush();

	// Initialize the display backlight

	// Backlight pin GPIO configuration
	PORT.GPIO_Mode  = GPIO_Mode_AF;
	PORT.GPIO_Speed = GPIO_Speed_40MHz;
	PORT.GPIO_OType = GPIO_OType_PP;
	PORT.GPIO_PuPd  = GPIO_PuPd_NOPULL;
	PORT.GPIO_Pin   = LCD_BL_PIN;
	GPIO_Init(LCD_BL_PORT,&PORT);
	GPIO_PinAFConfig(LCD_BL_PORT,LCD_BL_PIN_SRC,LCD_BL_GPIO_AF);

	// TIM3_CH1 as PWM output
	LCD_BL_TIM_RCC |= LCD_BL_TIM_PERIPH; // Enable the TIMx peripheral
	LCD_BL_TIM->CR1   |= TIM_CR1_ARPE; // Auto-preload enable
	LCD_BL_TIM->CR2    = 0; // Clear this just for any case
	LCD_BL_TIM->CCMR1 |= TIM_CCMR1_OC1PE; // Output compare 1 preload enable
	LCD_BL_TIM->CCMR1 |= TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1; // PWM mode 1
	LCD_BL_TIM->PSC    = SystemCoreClock / 40000; // 400Hz PWM
	LCD_BL_TIM->ARR    = 99; // 100 levels of backlight
	LCD_BL_TIM->CCR1   = 50; // 50% duty cycle
	LCD_BL_TIM->CCER  |= TIM_CCER_CC1NP | TIM_CCER_CC1E; // Output compare 1 enable, negative polarity
	LCD_BL_TIM->EGR    = 1; // Generate an update event to reload the prescaler value immediately
	LCD_BL_TIM->CR1   |= TIM_CR1_CEN; // Counter enable

//	i = 0;
//	int8_t di = 1;
//	while (1) {
//		LCD_BL_TIM->CCR1 = i;
//		i += di;
//		if ((i > 99) || (i == 0)) di *= -1;
//		Delay_ms(50);
//	}
	LCD_BL_TIM->CCR1 = lcd_backlight;




	// Configure USB sense pin
	RCC->AHBENR |= USB_SENS_PERIPH; // Enable USB sense pin port peripheral

	// Configure GPIO pin as input with pull-down
	USB_SENS_PORT->MODER &= ~GPIO_MODER_MODER10; // Input mode (reset state)
	USB_SENS_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR10; // Floating (clear bits)
	USB_SENS_PORT->PUPDR |=  GPIO_PUPDR_PUPDR10_1; // Pull-down

/*
	// Configure the EXTI line (USB sense pin)
	EXTI->PR    =  USB_SENS_EXTI; // Clear IT pending bit for EXTI
	EXTI->IMR  |=  USB_SENS_EXTI; // Enable interrupt request from EXTI
	EXTI->EMR  &= ~USB_SENS_EXTI; // Disable event on EXTI
	EXTI->RTSR |=  USB_SENS_EXTI; // Trigger rising edge enabled
	EXTI->FTSR |=  USB_SENS_EXTI; // Trigger falling edge enabled

	// PA10 as source input for EXTI10
	// In fact this is not necessary because it is the default condition after reset
	SYSCFG->EXTICR[2] &= ~SYSCFG_EXTICR3_EXTI10; // Clear bits (Set PA10 pin as input source)
	SYSCFG->EXTICR[2] |=  SYSCFG_EXTICR3_EXTI10_PA; // Set PA10 pin as input source
*/

/*
	// Enable the USB sense pin interrupt
	NVICInit.NVIC_IRQChannel = USB_SENS_EXTI_N;
	NVICInit.NVIC_IRQChannelPreemptionPriority = 2;
	NVICInit.NVIC_IRQChannelSubPriority = 0;
	NVICInit.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVICInit);
*/

	// Simple enable the USB sense pin interrupt
//	NVIC_EnableIRQ(USB_SENS_EXTI_N);

	_USB_connected = (USB_SENS_PORT->IDR & USB_SENS_PIN) ? 1 : 0;

/*
	if (_USB_connected) {
		// Configure the USB peripheral
		USB_HWConfig();
		// Initialize the USB device
		USB_Init();
	}
*/




	// Buttons initialization
	for (i = 0; i < 4; i++) memset(&BTN[i],0,sizeof(BTN[i]));
	BTN[0].PORT  = BTN0_PORT;
	BTN[0].PIN   = BTN0_PIN;
	BTN[0].EXTIn = BTN0_EXTI;

	BTN[1].PORT  = BTN1_PORT;
	BTN[1].PIN   = BTN1_PIN;
	BTN[1].EXTIn = BTN1_EXTI;

	BTN[2].PORT  = BTN2_PORT;
	BTN[2].PIN   = BTN2_PIN;
	BTN[2].EXTIn = BTN2_EXTI;

	BTN[3].PORT  = BTN3_PORT;
	BTN[3].PIN   = BTN3_PIN;
	BTN[3].EXTIn = BTN3_EXTI;

	// Enable button GPIOx peripherals (pins where buttons connected)
	RCC->AHBENR |= BTN0_PERIPH | BTN1_PERIPH | BTN2_PERIPH | BTN3_PERIPH;

	PORT.GPIO_Speed = GPIO_Speed_2MHz;
	PORT.GPIO_Mode  = GPIO_Mode_IN;
	PORT.GPIO_PuPd  = GPIO_PuPd_NOPULL;

	// Button#0 (PB10)
	PORT.GPIO_Pin = BTN0_PIN;
	GPIO_Init(BTN0_PORT,&PORT);
	// Button#1 (PB11)
	PORT.GPIO_Pin = BTN1_PIN;
	GPIO_Init(BTN1_PORT,&PORT);
	// Button#2 (PA15)
	PORT.GPIO_Pin = BTN2_PIN;
	GPIO_Init(BTN2_PORT,&PORT);
	// Button#3 (PA0)
	PORT.GPIO_Pin = BTN3_PIN;
	GPIO_Init(BTN3_PORT,&PORT);

