LonelyWolf/stm32/stm32l151rdt6-dev/main.c
			total_space = vi.numclusters * vi.clustersize;
			free_space  = cfree * vi.clustersize;
			used_space  = (vi.numclusters - cfree) * vi.clustersize;

			printf("Used space: %10ub [%uMB]\r\n",used_space,used_space / 1048576);
			printf("Free space: %10ub [%uMB]\r\n",free_space,free_space / 1048576);
			printf("Capacity  : %10ub [%uMB]\r\n",total_space,total_space / 1048576);

			di.scratch = sector;

			// List files in root directory of SD card
			if (DFS_OpenDir(&vi,(uint8_t *)"",&di)) {
				printf("Error opening root directory.\r\n");
			} else {
				while (!DFS_GetNext(&vi,&di,&de)) {
					if (de.name[0]) {
						// Warning: there is no zero terminator in name
						printf("file: \"%s\" [%c%c%c%c%c] %10u\r\n",
								de.name,
								(de.attr & ATTR_DIRECTORY) ? 'D' : '-',
								(de.attr & ATTR_READ_ONLY) ? 'R' : '-',
								(de.attr & ATTR_HIDDEN)    ? 'H' : '-',
								(de.attr & ATTR_SYSTEM)    ? 'S' : '-',
								(de.attr & ATTR_ARCHIVE)   ? 'A' : '-',
								(de.filesize_3 << 24) | (de.filesize_2 << 16) | (de.filesize_1 << 8) | de.filesize_0);
					}
				}
			}

			// List files in LOG directory
			if (DFS_OpenDir(&vi,(uint8_t *)LOG_DIR_LOGS,&di)) {
				printf("Error opening \".\\%s\" directory.\r\n",LOG_DIR_LOGS);
			} else {
				while (!DFS_GetNext(&vi,&di,&de)) {
					if (de.name[0]) {
						// Warning: there is no zero terminator in name
						printf("file: \"%s\" [%c%c%c%c%c] %10u\r\n",
								de.name,
								(de.attr & ATTR_DIRECTORY) ? 'D' : '-',
								(de.attr & ATTR_READ_ONLY) ? 'R' : '-',
								(de.attr & ATTR_HIDDEN)    ? 'H' : '-',
								(de.attr & ATTR_SYSTEM)    ? 'S' : '-',
								(de.attr & ATTR_ARCHIVE)   ? 'A' : '-',
								(de.filesize_3 << 24) | (de.filesize_2 << 16) | (de.filesize_1 << 8) | de.filesize_0);
					}
				}
			}
		}

		// END OF SD CARD THESTS
	}




    printf("---------------------------------------------\r\n");




	BEEPER_Enable(2500,1);




/*
    // Configure the RTC alarm A at 30th second on every minute
	_time.RTC_Hours   = 00;
	_time.RTC_Minutes = 00;
	_time.RTC_Seconds = 30;

	RTC_AlarmCmd(RTC_ALARM_A,DISABLE); // Disable the alarm A
	RTC_SetAlarm(RTC_ALARM_A,&_time,0,RTC_ALARM_MASK_DAY | RTC_ALARM_MASK_HRS | RTC_ALARM_MASK_MIN);
	RTC_ITConfig(RTC_IT_ALRA,ENABLE); // Enable the alarm A interrupt
	RTC_AlarmCmd(RTC_ALARM_A,ENABLE); // Enable the alarm A

	// Configure the RTC alarm A at 10th minute of every hour
	_time.RTC_Hours   = 00;
	_time.RTC_Minutes = 10;
	_time.RTC_Seconds = 00;

	RTC_AlarmCmd(RTC_ALARM_A,DISABLE); // Disable the alarm A
	RTC_SetAlarm(RTC_ALARM_A,&_time,0,RTC_ALARM_MASK_DAY | RTC_ALARM_MASK_HRS | RTC_ALARM_MASK_SEC);
	RTC_ITConfig(RTC_IT_ALRA,ENABLE); // Enable the alarm A interrupt
	RTC_AlarmCmd(RTC_ALARM_A,ENABLE); // Enable the alarm A

	// Configure the RTC alarm A at 3:30:33 every day
	_time.RTC_Hours   = 03;
	_time.RTC_Minutes = 30;
	_time.RTC_Seconds = 33;

	RTC_AlarmCmd(RTC_ALARM_A,DISABLE); // Disable the alarm A
	RTC_SetAlarm(RTC_ALARM_A,&_time,0,RTC_ALARM_MASK_DAY);
	RTC_ITConfig(RTC_IT_ALRA,ENABLE); // Enable the alarm A interrupt
	RTC_AlarmCmd(RTC_ALARM_A,ENABLE); // Enable the alarm A
*/




	// Measure LCD performance
	RCC->AHBENR |= RCC_AHBENR_DMA1EN; // Enable the DMA1 peripheral clock

///*
	// GFX Demo (rotozoomer with checkerboard or XOR texture)
	float ca,sa;
	float scalee = 0.5;
	float dscalee = 0.05;
	float angle = 0.0;
	float x,y;
	float xrow = 0.0;
	float yrow = 0.0;

    RTC_SetWakeUp(10);
    _new_time = FALSE;
    ST7541_Fill(0x0000);
    d0 = 0;
	while(1) {
		ca = scalee * cosf(angle);
		sa = scalee * sinf(angle);
		xrow = sa;
		yrow = ca;
		for (j = 31; j < 127; j++) {
			x = xrow;
			y = yrow;
			for (i = 1; i < 127; i++) {
				x += ca;
				y += sa;
//				Pixel(i,j,((((int8_t)x >> 3) & 1) ^ (((int8_t)y >> 3) & 1)) ? gs_black : gs_white); // Black and white checker board
				Pixel(i,j,(((int8_t)x >> 3) & 3) ^ (((int8_t)y >> 3) & 3)); // 2-bit XOR texture
			}
			xrow += -sa;
			yrow +=  ca;
		}
		angle += 0.05;
		scalee += ((scalee <= 0.10) || (scalee >= 1.3)) ? dscalee *= -1: dscalee;

		Rect(0,30,127,127,gs_black);
		FillRect(0,0,127,29,gs_white);

		// Draw FPS with shadow effect
		lcd_color = gs_ltgray;
		i = PutIntF(4,4,d0,1,fnt7x10) + 4;
		PutStr(i,4,"FPS",fnt7x10);
		lcd_color = gs_dkgray;
		i = PutIntF(3,3,d0,1,fnt7x10) + 4;
		PutStr(i,3,"FPS",fnt7x10);
		lcd_color = gs_black;
		i = PutIntF(2,2,d0,1,fnt7x10) + 4;
		PutStr(i,2,"FPS",fnt7x10);

		// Draw packets count
		i = 64;
		i += PutStr(i,2,"Pkts:",fnt5x7);
		PutIntU(i,2,_packets_rcvd,fnt5x7);
		i = 64;
		i += PutStr(i,10,"Lost:",fnt5x7);
		PutIntU(i,10,_packets_lost,fnt5x7);

		// Draw time
		RTC_GetDateTime(&_time,&_date);
		i = 0;
		i += PutIntLZ(i,22,_time.RTC_Hours,2,fnt5x7);
		i += DrawChar(i,22,':',fnt5x7);
		i += PutIntLZ(i,22,_time.RTC_Minutes,2,fnt5x7);
		i += DrawChar(i,22,':',fnt5x7);
		i += PutIntLZ(i,22,_time.RTC_Seconds,2,fnt5x7);
		i += 3;
		i += PutIntLZ(i,22,_date.RTC_Date,2,fnt5x7);
		i += DrawChar(i,22,'.',fnt5x7);
		i += PutIntLZ(i,22,_date.RTC_Month,2,fnt5x7);
		i += DrawChar(i,22,'.',fnt5x7);
		i += PutIntLZ(i,22,_date.RTC_Year,2,fnt5x7);
		PutStr(i + 3,22,RTC_DOW_STR[_date.RTC_WeekDay - 1],fnt5x7);


		ST7541_Flush_DMA();
		k++;

		if (_new_time) {
			d0 = k;
			_new_time = FALSE;
			k = 0;
		}

	    if (BTN[BTN_UP].state == BTN_Pressed) {
	    	if (lcd_backlight < 95) lcd_backlight += 5; else lcd_backlight = 100;
	    	LCD_BL_TIM->CCR1 = lcd_backlight;
	    }
	    if (BTN[BTN_DOWN].state == BTN_Pressed) {
	    	if (lcd_backlight > 5) lcd_backlight -= 5; else lcd_backlight = 0;
	    	LCD_BL_TIM->CCR1 = lcd_backlight;
	    }
	    if (BTN[BTN_ESCAPE].state == BTN_Pressed) {
	    	// Reset the MCU
//	    	NVIC_SystemReset();

	    	// Setup partial display mode
			ST7541_SetDisplayPartial(32,0,64);
			ST7541_Contrast(5,5,10);

	    	// Put MCU into STANDBY mode
	    	PWR->CSR |= PWR_CSR_EWUP1; // Enable WKUP pin 1 (PA0)
	    	PWR->CSR |= PWR_CSR_EWUP2; // Enable WKUP pin 2 (PC13)
	    	SleepStandby();
	    }
	}
//*/

