LonelyWolf/stm32/stm32l151rdt6-dev/main.c
    ST7541_Fill(0x0000);
	k = 0;
    for (i = 0; i < 8; i++) {
		d0 = 16 + (i * 12);
    	for (j = 0; j < 8; j++) {
    		d1 = 29 + (j * 12);
    		FillRect(d0,d1,d0 + 11,d1 + 11,(k) ? gs_white : gs_ltgray);
    		Rect(d0,d1,d0 + 11,d1 + 11,gs_black);
    		k = !k;
    	}
    	k = !k;
    }
    Rect(0,0,127,127,gs_black);
    ST7541_Flush_DMA();
    while(1);

/*
    // Test partial display and power saving
	ST7541_Flush();
	Delay_ms(2000);
	ST7541_Contrast(5,5,10);
	ST7541_SetDisplayPartial(32,0,64);
	Delay_ms(4000);
	ST7541_PowerSave(ON);
	Delay_ms(10000);
	ST7541_PowerSave(OFF);
	ST7541_SetDisplayPartial(0,0,128);
	ST7541_Contrast(lcd_res_ratio,lcd_lcd_bias,lcd_el_vol);
*/

    RTC_SetWakeUp(10);
    _new_time = FALSE;
	while(1) {
		k = 0;
		while (!_new_time) {
			ST7541_Flush_DMA();
//			ST7541_Flush();
			k++;
		}
		FillRect(2,2,63,12,gs_white);
		i = PutIntF(2,2,k,1,fnt7x10) + 2;
		PutStr(i,2,"FPS",fnt7x10);
		printf("DTM: %s, %02u:%02u:%02u %02u.%02u.20%02u\r\n",
				RTC_DOW_STR[_date.RTC_WeekDay - 1],
				_time.RTC_Hours,
				_time.RTC_Minutes,
				_time.RTC_Seconds,
				_date.RTC_Date,
				_date.RTC_Month,
				_date.RTC_Year
			);
		printf("FPS = %u.%u\r\n",k / 10,k % 10);
		_new_time = FALSE;
	}
	// Results with 125kHz
	// ST7541_data :   3.8FPS
	// SPIx_SendBuf:   3.8FPS
	// DMA         :   3.8FPS

	// Result with 2MHz
	// ST7541_data :  34.7FPS
	// SPIx_SendBuf:  60.9FPS
	// DMA         :  60.9FPS

	// Result with 4MHz
	// ST7541_data :  47.3FPS
	// SPIx_SendBuf: 121.7FPS
	// SPIx_SendBuf16: 121.7FPS
	// DMA         : 121.7FPS

	// Result with 8MHz
	// ST7541_data :  57.4FPS
	// SPIx_SendBuf: 149.9FPS
	// SPIx_SendBuf_2: 204.7FPS
	// SPIx_Sendbuf16: 242.9FPS
	// DMA         : 243.0FPS
	// DMA16       : 242.7FPS

	// Results with 16MHz
	// ST7541_data :  64.5FPS
	// SPIx_SendBuf: 149.9FPS
	// SPIx_SendBuf_2: 204.8FPS
	// SPIx_SendBuf16: 430.4FPS <-- FAIL (LCD is not fast enough for this)
	// DMA         : 430.2FPS <-- FAIL (LCD is not fast enough for this)
	// DMA16       : 482.8FPS <-- FAIL (LCD is not fast enough for this)




	while(1) {
		// Date/time
		RTC_GetDateTime(&_time,&_date);
		printf("DTM: %s, %02u:%02u:%02u %02u.%02u.20%02u\r\n",
				RTC_DOW_STR[_date.RTC_WeekDay - 1],
				_time.RTC_Hours,
				_time.RTC_Minutes,
				_time.RTC_Seconds,
				_date.RTC_Date,
				_date.RTC_Month,
				_date.RTC_Year
			);

//		printf("BTN: #0 IDR=%s\r\n",(GPIOB->IDR & GPIO_Pin_10) ? "HI" : "LOW");
//		printf("BTN: #1 IDR=%s\r\n",(GPIOB->IDR & GPIO_Pin_11) ? "HI" : "LOW");
//		printf("BTN: #2 IDR=%s\r\n",(GPIOA->IDR & GPIO_Pin_15) ? "HI" : "LOW");
//		printf("BTN: #3 IDR=%s\r\n",(GPIOA->IDR & GPIO_Pin_0)  ? "HI" : "LOW");

		// Buttons
		for (i = 0; i < 4; i++) {
			printf("BTN: #%u CNTR=%u HOLD=%u STATE=%02X IDR=%s\r\n",
					i,
					BTN[i].cntr,
					BTN[i].hold_cntr,
					BTN[i].state,
					(BTN[i].PORT->IDR & BTN[i].PIN) ? "HI" : "LOW");
		}

		// Measure Vbat
/*
		// Do 16 ADC measurements and calculate rough average
		ADC1_raw = 0;
		Vrefint_raw = 0;
		for (i = 0; i < 16; i++) {
			ADC1->CR2 |= ADC_CR2_JSWSTART; // Start conversion of injected channels
			while (!(ADC1->SR & ADC_SR_JEOC)); // Wait until ADC conversions end
			ADC1_raw    += ADC1->JDR1; // Read injected data register1 (ADC_IN1)
			Vrefint_raw += ADC1->JDR2; // Read injected data register2 (ADC_IN17)
			if (i) {
				ADC1_raw >>= 1;
				Vrefint_raw >>= 1;
			}
			ADC1->SR &= ~ADC_SR_JEOC; // Clear JEOC bit (is this necessary?)
		}
*/

		// Do 16 ADC measurements
		for (i = 0; i < 16; i++) {
			ADC1->CR2 |= ADC_CR2_JSWSTART; // Start conversion of injected channels
			while (!(ADC1->SR & ADC_SR_JEOC)); // Wait until ADC conversions end
			ADC1_raws[i]    = ADC1->JDR1; // Read injected data register1 (ADC_IN1)
			Vrefint_raws[i] = ADC1->JDR2; // Read injected data register2 (ADC_IN17)
		}
		// Calculate interquartile mean values of ADC readings
		ADC1_raw = InterquartileMean(ADC1_raws,16);
		Vrefint_raw = InterquartileMean(Vrefint_raws,16);

		// Convert ADC readings to voltage
		Vbat = (uint16_t)(((*VREFINT_CAL * ADC1_raw * 3.0)/(Vrefint_raw * 4095.0)) * 1000);
		Vrefint = (uint16_t)(((Vrefint_raw * 3.0) / 4095.0) * 1000);
		Vcpu = (uint16_t)(((*VREFINT_CAL * 3.0) / Vrefint_raw) * 1000);
		printf("VOL: Bat=[%u.%03uV -> %u.%03uV] Ref=%u.%03uV CPU=%u.%03uV\r\n",
				(unsigned int)Vbat / 1000, (unsigned int)Vbat % 1000,
				((unsigned int)Vbat / 1000) * 2, ((unsigned int)Vbat % 1000) * 2,
				(unsigned int)Vrefint / 1000, (unsigned int)Vrefint % 1000,
				(unsigned int)Vcpu / 1000, (unsigned int)Vcpu % 1000);

		// Get ALS readings
		d0 = TSL2581_GetData0();
		d1 = TSL2581_GetData1();
		printf("ALS: D0=%u D1=%u\r\n", (unsigned int)d0, (unsigned int)d1);

		// Get accelerometer readings
		BMC050_ACC_GetXYZ(&X,&Y,&Z);
		ACCT = BMC050_ReadTemp();
		printf("ACC: X=%d Y=%d Z=%d T=%d.%dC\r\n", X, Y, Z, ACCT / 10, ACCT % 10);

		// Get barometer readings
		BR = BMP180_GetReadings(&RT,&RP,BMP180_ADVRES);
		if (BR == BMP180_SUCCESS) {
			RP = BMP180_hPa_to_mmHg(RP);
			printf("BAR: T=%d.%dC P=%u.%ummHg\r\n", RT / 10, RT % 10, (unsigned int)RP / 10, (unsigned int)RP % 10);
		} else {
			printf("BAR: failed\r\n");
		}

		// USB sense pin state
		printf("USB: %s (%d)\r\n",_USB_connected ? "connected" : "disconnected",(unsigned int)_USB_int_cntr);
/*
		if (_USB_connected) {
			BEEPER_Enable(4444,1);
			// USB cable plugged
			if (bDeviceState != CONFIGURED) {
				// USB device is not configured, try to initialize it
				USBdev_Init();
			}
		} else {
			// USB cable unplugged
			if (bDeviceState == CONFIGURED) {
				// USB device is configured, deinitialize it
				PowerOff();
				bDeviceState = UNCONNECTED;
				pInformation->Current_Configuration = 0;
			}
		}
*/

		// Get charger STAT pin state
		i = 0;
		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
		Delay_ms(100);
		printf("CHG: NONE=%d ",(unsigned int)(CHRG_STAT_PORT->IDR & CHRG_STAT_PIN));
		if (CHRG_STAT_PORT->IDR & CHRG_STAT_PIN) i++;

		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
		CHRG_STAT_PORT->PUPDR |=  GPIO_PUPDR_PUPDR2_1; // Pull-down
		Delay_ms(100);
		printf("PD=%d ",(unsigned int)(CHRG_STAT_PORT->IDR & CHRG_STAT_PIN));
		if (CHRG_STAT_PORT->IDR & CHRG_STAT_PIN) i++;

		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
		CHRG_STAT_PORT->PUPDR |=  GPIO_PUPDR_PUPDR2_0; // Pull-up
		Delay_ms(100);
		printf("PU=%d\r\n",(unsigned int)(CHRG_STAT_PORT->IDR & CHRG_STAT_PIN));

		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)

		// SD card state
		printf("SDC: %s (%d)\r\n",_SD_connected ? "present" : "no card",(unsigned int)_SD_int_cntr);
		if (_SD_last_state != _SD_connected) {
			if (_SD_connected) {
				// The SD card was inserted, need to initialize it
				j = SD_Init();
				printf("SD_Init: %X\r\n",j);
				if ((j == SDR_Success) && (SDCard.Type != SDCT_MMC)) {
					// MMC doesn't support 4-bit bus
					if (SDCard.SCR[1] & 0x05) SD_SetBusWidth(SD_BUS_4BIT);
				}
			}
		}
		_SD_last_state = _SD_connected;

		// Read some blocks from the SD card
		if (_SD_connected) {
/*
			for (i = 0; i < 2048; ) sector[i++] = '#';
			j = SD_ReadBlock(0,(uint32_t *)sector,2048);
			printf("SD_ReadBlock = %02X, ",j);
			if (j != SDR_Success) BEEPER_Enable(1111,1);
			j = SD_GetCardState(&sector[0]);
			printf("SD_GetCardState = %02X [%X]\r\n",j,sector[0]);
*/
			for (i = 0; i < 2048; ) sector[i++] = '#';
			j = SD_ReadBlock_DMA(0,(uint32_t *)sector,2048);
			printf("ReadBlock_DMA = %02X, ",j);
			if (j == SDR_Success) {
				j = SD_CheckRead(2048);
				printf("CheckRead = %02X, ",j);
			}
			if (j != SDR_Success) BEEPER_Enable(4444,1);

			j = SD_GetCardState(&sector[0]);
			printf("CardState = %02X [%X]\r\n",j,sector[0]);
		}

#ifdef NRF24_SOLAR
		// Yep, the following code is so ugly =)

		// Solar temperature sensor packet
		printf("NRF: %upkts%s",_packets_rcvd,(_new_packet) ? " " : "\r\n");
		if (_new_packet) {
			RT = (nRF24_RX_Buf[0] << 8) | nRF24_RX_Buf[1]; // Temperature
			Vrefint = (nRF24_RX_Buf[6] << 8) + nRF24_RX_Buf[7]; // Sensor voltage
			printf("[#%u TEMP: %d.%dC VREF: %u.%02uV LSI: %uHz OTX: %u/%u %02u:%02u:%02u %02u.%02u.20%02u]\r\n",
					(uint32_t)((nRF24_RX_Buf[2] << 24)|(nRF24_RX_Buf[3] << 16)|(nRF24_RX_Buf[4] << 8)|(nRF24_RX_Buf[5])), /* Packet number */
					RT / 10, RT % 10,
					Vrefint / 100, Vrefint % 100,
					(nRF24_RX_Buf[14] << 8) + nRF24_RX_Buf[15], /* Sensor MCU LSI frequency */
					nRF24_RX_Buf[16] >> 4, nRF24_RX_Buf[16] & 0x0F, /* Sensor nRF24 OTX register: lost packets/number of retries */
					(((nRF24_RX_Buf[10] & 0x30) >> 4) * 10) + (nRF24_RX_Buf[10] & 0x0F), /* Time: hours */
					((nRF24_RX_Buf[9] >> 4) * 10) + (nRF24_RX_Buf[9] & 0x0F), /* Time: minutes */
					((nRF24_RX_Buf[8] >> 4) * 10) + (nRF24_RX_Buf[8] & 0x0F), /* Time: seconds */
					((nRF24_RX_Buf[11] >> 4) * 10) + (nRF24_RX_Buf[11] & 0x0F), /* Date: day */
					(((nRF24_RX_Buf[12] & 0x1f) >> 4) * 10) + (nRF24_RX_Buf[12] & 0x0F), /* Date: month */
					((nRF24_RX_Buf[13] >> 4) * 10) + (nRF24_RX_Buf[13] & 0x0F) /* Date: year */
					);

			// Write data to log file
			if (_logging) {
				// Sensor time
				LOG_WriteTime(
						(((nRF24_RX_Buf[10] & 0x30) >> 4) * 10) + (nRF24_RX_Buf[10] & 0x0F),
						((nRF24_RX_Buf[9] >> 4) * 10) + (nRF24_RX_Buf[9] & 0x0F),
						((nRF24_RX_Buf[8] >> 4) * 10) + (nRF24_RX_Buf[8] & 0x0F));
				LOG_WriteStr(";");
				// Sensor date
				LOG_WriteDate(
						((nRF24_RX_Buf[11] >> 4) * 10) + (nRF24_RX_Buf[11] & 0x0F),
						(((nRF24_RX_Buf[12] & 0x1f) >> 4) * 10) + (nRF24_RX_Buf[12] & 0x0F),
						((nRF24_RX_Buf[13] >> 4) * 10) + (nRF24_RX_Buf[13] & 0x0F));
				LOG_WriteStr(";");
				// Packet number
				LOG_WriteIntU((uint32_t)((nRF24_RX_Buf[2] << 24)|(nRF24_RX_Buf[3] << 16)|(nRF24_RX_Buf[4] << 8)|(nRF24_RX_Buf[5])));
				LOG_WriteStr(";");
				// Temperature
				LOG_WriteInt(RT / 10);
				LOG_WriteStr(".");
				LOG_WriteInt(RT % 10);
				LOG_WriteStr("C;");
				// Sensor voltage
				LOG_WriteIntF(Vrefint,2);
				LOG_WriteStr("V;");
				// Sensor MCU LSI frequency
				LOG_WriteIntU((nRF24_RX_Buf[14] << 8) + nRF24_RX_Buf[15]);
				LOG_WriteStr("Hz;");
				// Sensor nRF24 OTX register (shockburst)
				LOG_WriteIntU(nRF24_RX_Buf[16] >> 4); // Lost packets
				LOG_WriteStr(";");
				LOG_WriteIntU(nRF24_RX_Buf[16] & 0x0F); // Number of retries
				LOG_WriteStr("\r\n");
				LOG_FileSync(); // Save data buffer to SD card
			}

			_new_packet = FALSE;
		}
#else
		// WBC packet
		printf("NRF: %upkts%s",_packets_rcvd,(_new_packet) ? " " : "\r\n");
		if (_new_packet) {
			printf("[VBAT: %u.%02uV WAKE: %u]\r\n",
					nRF24_Packet.vrefint / 100, nRF24_Packet.vrefint % 100,
					nRF24_Packet.cntr_wake);
			_new_packet = FALSE;
		}
#endif

		i = BMC050_ACC_GetIRQStatus();
		printf("ACC: %s [%04X]\r\n",(ACC_IRQ_PORT->IDR & ACC_IRQ_PIN) ? "HIGH" : "LOW",i);
//		BMC050_ACC_SetIRQMode(ACC_IM_RESET); // Clear IRQ bits

