LonelyWolf/stm32/stm32l151rdt6-dev/main.c
	    printf("---------------------------------------------\r\n");

//		BEEPER_Enable(111,1);

//		Delay_ms(2000);

	    ST7541_Fill(0x0000);

/*
		// Gray shades
	    FillRect(0,100,31,127,gs_black);
	    FillRect(32,100,63,127,gs_dkgray);
	    FillRect(64,100,95,127,gs_ltgray);
	    FillRect(96,100,127,127,gs_white);
*/
///*
	    // Chess board
	    k = 0;
	    for (i = 0; i < 8; i++) {
    		d0 = 16 + (i * 12);
	    	for (j = 0; j < 8; j++) {
	    		d1 = 29 + (j * 12);
	    		FillRect(d0,d1,d0 + 11,d1 + 11,(k) ? gs_white : gs_ltgray);
	    		Rect(d0,d1,d0 + 11,d1 + 11,gs_black);
	    		k = !k;
	    	}
	    	k = !k;
	    }
//*/

	    Rect(0,0,127,127,gs_black);
	    ST7541_Flush();

	    // Put MCU into SLEEP mode
		SleepWait();

	    // Put MCU into STOP mode
//	    SleepStop();

		// Put MCU into STANDBY mode
//		PWR->CSR |= PWR_CSR_EWUP1; // Enable WKUP pin 1 (PA0)
//		PWR->CSR |= PWR_CSR_EWUP2; // Enable WKUP pin 2 (PC13)
//		SleepStandby();

/*
	    if (BTN[BTN_UP].state == BTN_Pressed) {
	    	BEEPER_PlayTones(tones_3beep);
	    	while(_tones_playing);
	    	RTC_SetWakeUp(0); // Disable RTC wake-up
	    	PWR->CSR |= PWR_CSR_EWUP1; // Enable WKUP pin 1 (PA0)
	    	PWR->CSR |= PWR_CSR_EWUP2; // Enable WKUP pin 2 (PC13)
	    	SleepStandby();
	    } else {
	    	SleepWait();
	    }
*/
	}




	// Put MCU into STANDBY mode
	PWR->CSR |= PWR_CSR_EWUP1; // Enable WKUP pin 1 (PA0)
	PWR->CSR |= PWR_CSR_EWUP2; // Enable WKUP pin 2 (PC13)
	SleepStandby();

	// After STANDBY the MCU will go RESET routine, not here
	while(1);
}
